//  Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.

Console.WriteLine("Введите число");
string number = Convert.ToString(Console.ReadLine());
Console.WriteLine(number.Length);